In [1]:
import pandas as pd
import numpy as np

In [55]:
df = pd.DataFrame(data=[['frIeD rIcC'], ['mSc n cheese'], ['fried fish'], ['fish n chips']], columns=['name'])

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
dtypes: object(1)
memory usage: 160.0+ bytes

In [53]:
df.describe()

              name
count            4
unique           4
top     fried rice
freq             1

In [58]:
df['name'].str.capitalize()

0      Fried ricc
1    Msc n cheese
2      Fried fish
3    Fish n chips
Name: name, dtype: object

In [65]:
df4 = pd.DataFrame(data=[['thick'], ['thin'], ['cheese stuffed'], ['NY style'], ['Sicilian style']],   columns=['pizza_crust_type'])
df4['pizza_crust_type'].isin(['thin', 'thick'])

0     True
1     True
2    False
3    False
4    False
Name: pizza_crust_type, dtype: bool

In [63]:
df4[df4['pizza_crust_type'].isin(['thin', 'thick'])]

  pizza_crust_type
0            thick
1             thin

In [108]:
df5 = pd.DataFrame(data=[[100], [76], [91], [60], [89], [96], [86], [34]], columns=['grade'])

In [97]:
df5

   grade
0    100
1     76
2     91
3     60
4     89
5     96
6     86
7     34

In [78]:
df5['grade'].apply(grade_description)

0    A
1    C
2    B
3    D
4    B
5    A
Name: grade, dtype: object

In [82]:
def grade_description_1(grade: int) -> int:
    try:
        grade = int(grade)
    except:
        return 'Wrong'

    if grade >= 60 and grade <= 75:
        return '2'
    elif grade > 75 and grade <= 85:
        return '3'
    elif grade > 85 and grade <= 95:
        return '4'
    elif grade > 95 and grade <= 100:
        return '5'
    elif grade >= 15 and grade < 60:
        return '1'
    else:
        return 'Wrong'

In [109]:
df5['Mark System'] = df5['grade'].apply(grade_description_1)
df5['ABCDE'] = df5['grade'].apply(grade_description)

In [112]:
df5['ABCDE'].unique()

array(['A', 'C', 'B', 'D', 'Fx'], dtype=object)

In [113]:
df5.value_counts()

grade  Mark System  ABCDE
34     1            Fx       1
60     2            D        1
76     3            C        1
86     4            B        1
89     4            B        1
91     4            B        1
96     5            A        1
100    5            A        1
dtype: int64

In [90]:
def grade_description(grade:int) -> str:
    try:
        grade = int(grade)
    except: 
        return 'Wrong'
    
    if grade >= 60 and grade <= 75:
        return 'D'
    elif grade > 75 and grade <= 85:
        return 'C'
    elif grade > 85 and grade <= 95:
        return 'B'
    elif grade > 95 and grade <= 100:
        return 'A'
    elif grade >= 15 and grade < 60:
        return 'Fx'
    else:
        return 'Wrong'

In [9]:
#df.value_counts()


# pd.concat
## Concatenate dataframes along index / columns

In [116]:
df1 = pd.DataFrame({'A': [1, 2, 3, 4], 'B': [5, 6, 7, 8]})

In [117]:
df2 = pd.DataFrame({'A': [100, 150, 200], 'B': [300, 400, 500]})

In [118]:
pd.concat([df1, df2], axis='index')

     A    B
0    1    5
1    2    6
2    3    7
3    4    8
0  100  300
1  150  400
2  200  500

In [120]:
pd.concat([df1, df2], axis='columns')

   A  B      A      B
0  1  5  100.0  300.0
1  2  6  150.0  400.0
2  3  7  200.0  500.0
3  4  8    NaN    NaN

In [121]:
df6 = pd.read_csv('https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2019/2019-10-08/ipf_lifts.csv')

In [123]:
df6.columns

Index(['name', 'sex', 'event', 'equipment', 'age', 'age_class', 'division',
       'bodyweight_kg', 'weight_class_kg', 'best3squat_kg', 'best3bench_kg',
       'best3deadlift_kg', 'place', 'date', 'federation', 'meet_name'],
      dtype='object')

In [136]:
df7 = pd.DataFrame({'A': [1, 2, 3, 4], 'B': [5, 6, 7, 8]})
df8 = pd.DataFrame({'C': [-1, -2, -3, -4], 'D': [0.1, 0.2, 0.3, 0.4]})

In [138]:
df7.join(df8, how='inner')

   A  B  C    D
0  1  5 -1  0.1
1  2  6 -2  0.2
2  3  7 -3  0.3
3  4  8 -4  0.4

In [33]:
# df1['Worldwide Gross Dollars'] = df.isna().sum()

In [157]:
df9 = pd.DataFrame({'A': [1, 2, 3, 4], 'B': [5, 6, 7, 8]})
df10 = pd.DataFrame({'A': [1, 3, 4, 6], 'C': [100, 200, 300, 400]})

In [141]:
df9.merge(df10, on='A')
# df1[''].isna().sum()

   A  B    C
0  1  5  100
1  3  7  200
2  4  8  300

In [158]:
df9.merge(df10, on='A', how='inner')

   A  B    C
0  1  5  100
1  3  7  200
2  4  8  300

In [160]:
dataframe = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two', 'two'],
                  'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                'baz': [1, 2, 3, 4, 5, 6],
                 'zoo': ['x', 'y', 'z', 'q', 'w', 't']})

In [35]:
# df1.dropna(axis=0,inplace=True)

In [167]:
dataframe

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [168]:
dataframe.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [ ]:
'''
SELECT * FROM таблица;
'''

In [36]:
#df1[''].fillna(df[''].median(), inplace=True)

In [ ]:
# df1[''].fillna(method='ffill', inplace=True)
# df1[''].fillna(method='bfill', inplace=True)
# df1[''].interpolate(method='polynomial')